cmsis-svd/cmsis-svd/data/Freescale/MKE14D7.svd
        <register>
          <name>DFPROT</name>
          <description>D-Flash Protection Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DPS</name>
              <description>EraseD-Flash Protection Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000</name>
                  <description>Flash address range: 0x00_0000 - 0x00_00FF; protected size: 256 bytes</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001</name>
                  <description>Flash address range: 0x00_0000 - 0x00_01FF; protected size: 512 bytes</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00010</name>
                  <description>Flash address range: 0x00_0000 - 0x00_02FF; protected size: 768 bytes</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00011</name>
                  <description>Flash address range: 0x00_0000 - 0x00_03FF; protected size: 1024 bytes</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00100</name>
                  <description>Flash address range: 0x00_0000 - 0x00_04FF; protected size: 1280 bytes</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00101</name>
                  <description>Flash address range: 0x00_0000 - 0x00_05FF; protected size: 1536 bytes</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00110</name>
                  <description>Flash address range: 0x00_0000 - 0x00_06FF; protected size: 1792 bytes</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00111</name>
                  <description>Flash address range: 0x00_0000 - 0x00_07FF; protected size: 2048 bytes</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01000</name>
                  <description>Flash address range: 0x00_0000 - 0x00_08FF; protected size: 2304 bytes</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01001</name>
                  <description>Flash address range: 0x00_0000 - 0x00_09FF; protected size: 2560 bytes</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01010</name>
                  <description>Flash address range: 0x00_0000 - 0x00_0AFF; protected size: 2816 bytes</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01011</name>
                  <description>Flash address range: 0x00_0000 - 0x00_0BFF; protected size: 3072 bytes</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01100</name>
                  <description>Flash address range: 0x00_0000 - 0x00_0CFF; protected size: 3328 bytes</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01101</name>
                  <description>Flash address range: 0x00_0000 - 0x00_0DFF; protected size: 3584 bytes</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01110</name>
                  <description>Flash address range: 0x00_0000 - 0x00_0EFF; protected size: 3840 bytes</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01111</name>
                  <description>Flash address range: 0x00_0000 - 0x00_0FFF; protected size: 4096 bytes</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10000</name>
                  <description>Flash address range: 0x00_0000 - 0x00_10FF; protected size: 4352 bytes</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10001</name>
                  <description>Flash address range: 0x00_0000 - 0x00_11FF; protected size: 4608 bytes</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>Flash address range: 0x00_0000 - 0x00_12FF; protected size: 4864 bytes</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10011</name>
                  <description>Flash address range: 0x00_0000 - 0x00_13FF; protected size: 5120 bytes</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10100</name>
                  <description>Flash address range: 0x00_0000 - 0x00_14FF; protected size: 5376 bytes</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10101</name>
                  <description>Flash address range: 0x00_0000 - 0x00_15FF; protected size: 5632 bytes</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10110</name>
                  <description>Flash address range: 0x00_0000 - 0x00_16FF; protected size: 5888 bytes</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10111</name>
                  <description>Flash address range: 0x00_0000 - 0x00_17FF; protected size: 6144 bytes</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11000</name>
                  <description>Flash address range: 0x00_0000 - 0x00_18FF; protected size: 6400 bytes</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11001</name>
                  <description>Flash address range: 0x00_0000 - 0x00_19FF; protected size: 6656 bytes</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11010</name>
                  <description>Flash address range: 0x00_0000 - 0x00_1AFF; protected size: 6912 bytes</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11011</name>
                  <description>Flash address range: 0x00_0000 - 0x00_1BFF; protected size: 7168 bytes</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11100</name>
                  <description>Flash address range: 0x00_0000 - 0x00_1CFF; protected size: 7424 bytes</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11101</name>
                  <description>Flash address range: 0x00_0000 - 0x00_1DFF; protected size: 7680 bytes</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11110</name>
                  <description>Flash address range: 0x00_0000 - 0x00_1EFF; protected size: 7936 bytes</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11111</name>
                  <description>Flash address range: 0x00_0000 - 0x00_1FFF; protected size: 8192 bytes</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPOPEN</name>
              <description>D-Flash Protection Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Enables D-Flash memory protection from program and erase with protected address range defined by DPS bits</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disables D-Flash memory protection from program and erase</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FPROT</name>
          <description>P-Flash Protection Register</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>FPLS</name>
              <description>Flash Protection Lower Address Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Address range: 0x00_0000-0x00_07FF; protected size: 2 KB</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Address range: 0x00_0000-0x00_0FFF; protected size: 4 KB</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Address range: 0x00_0000-0x00_1FFF; protected size: 8 KB</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Address range: 0x00_0000-0x00_3FFF; protected size: 16 KB</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPLDIS</name>
              <description>Flash Protection Lower Address Range Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Protection/Unprotection enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Protection/Unprotection disabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPHS</name>
              <description>Flash Protection Higher Address Size</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Address range: 0x00_7C00-0x00_7FFF; protected size: 1 KB</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Address range: 0x00_7800-0x00_7FFF; protected size: 2 KB</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Address range: 0x00_7000-0x00_7FFF; protected size: 4 KB</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Address range: 0x00_6000-0x00_7FFF; protected size: 8 KB</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPHDIS</name>
              <description>Flash Protection Higher Address Range Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Protection/Unprotection enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Protection/Unprotection disabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNV</name>
              <description>Reserved Nonvolatile Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FPOPEN</name>
              <description>Flash Protection Operation Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>When FPOPEN is clear, the FPHDIS and FPLDIS bits define unprotected address ranges as specified by the corresponding FPHS and FPLS bits</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>When FPOPEN is set, the FPHDIS and FPLDIS bits enable protection for the address range specified by the corresponding FPHS and FPLS bits</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOBLO</name>
          <description>Flash Common Command Object Low Register</description>
          <addressOffset>0xA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CCOBn</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOBHI</name>
          <description>Flash Common Command Object High Register</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CCOBn</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FECCRLO</name>
          <description>Flash ECC Error Results Low Register</description>
          <addressOffset>0xE</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ECCR</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FECCRHI</name>
          <description>Flash ECC Error Results High Register</description>
          <addressOffset>0xF</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ECCR</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FOPT</name>
          <description>Flash Option Register</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>NV</name>
              <description>Nonvolatile Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
